➜  BROWNFIELD cat main.tf
terraform {
  required_providers {
    azuread = {
      source = "hashicorp/azuread"
    }
    azurerm = {
      source  = "hashicorp/azurerm"
      version = "~> 2.28"
    }
    lacework = {
      source = "lacework/lacework"
      version = "~> 0.3"
    }
  }
}

provider "azurerm" {
  features {}
}

module "az_config" {
  source  = "lacework/config/azure"
  version = "~> 0.1"
}

module "az_activity_log" {
  source  = "lacework/activity-log/azure"
  version = "~> 0.1"

  use_existing_ad_application = true
  application_id              = module.az_config.application_id
  application_password        = module.az_config.application_password
  service_principal_id        = module.az_config.service_principal_id
}
➜  BROWNFIELD terraform init --upgrade
Upgrading modules...
Downloading lacework/activity-log/azure 0.3.2 for az_activity_log...
- az_activity_log in .terraform/modules/az_activity_log
Downloading lacework/ad-application/azure 0.2.2 for az_activity_log.az_al_ad_application...
- az_activity_log.az_al_ad_application in .terraform/modules/az_activity_log.az_al_ad_application
Downloading lacework/config/azure 0.2.2 for az_config...
- az_config in .terraform/modules/az_config
Downloading lacework/ad-application/azure 0.2.2 for az_config.az_cfg_ad_application...
- az_config.az_cfg_ad_application in .terraform/modules/az_config.az_cfg_ad_application

Initializing the backend...

Initializing provider plugins...
- Finding lacework/lacework versions matching "~> 0.3"...
- Finding hashicorp/azuread versions matching "~> 1.2"...
- Finding hashicorp/azurerm versions matching "~> 2.28"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Finding latest version of hashicorp/time...
- Using previously-installed lacework/lacework v0.11.2
- Installing hashicorp/azuread v1.6.0...
- Installed hashicorp/azuread v1.6.0 (signed by HashiCorp)
- Using previously-installed hashicorp/azurerm v2.80.0
- Using previously-installed hashicorp/random v3.1.0
- Using previously-installed hashicorp/time v0.7.2

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
➜  BROWNFIELD terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.az_activity_log.azurerm_eventgrid_event_subscription.lacework will be created
  + resource "azurerm_eventgrid_event_subscription" "lacework" {
      + advanced_filtering_on_arrays_enabled = false
      + event_delivery_schema                = "EventGridSchema"
      + eventhub_endpoint_id                 = (known after apply)
      + hybrid_connection_endpoint_id        = (known after apply)
      + id                                   = (known after apply)
      + included_event_types                 = [
          + "Microsoft.Storage.BlobCreated",
        ]
      + name                                 = (known after apply)
      + scope                                = (known after apply)
      + topic_name                           = (known after apply)

      + eventhub_endpoint {
          + eventhub_id = (known after apply)
        }

      + hybrid_connection_endpoint {
          + hybrid_connection_id = (known after apply)
        }

      + retry_policy {
          + event_time_to_live    = (known after apply)
          + max_delivery_attempts = (known after apply)
        }

      + storage_queue_endpoint {
          + queue_name         = (known after apply)
          + storage_account_id = (known after apply)
        }

      + subject_filter {
          + subject_begins_with = "/blobServices/default/containers/insights-operational-logs/"
        }
    }

  # module.az_activity_log.azurerm_monitor_log_profile.lacework[0] will be created
  + resource "azurerm_monitor_log_profile" "lacework" {
      + categories         = [
          + "Action",
          + "Delete",
          + "Write",
        ]
      + id                 = (known after apply)
      + locations          = [
          + "australiacentral",
          + "australiacentral2",
          + "australiaeast",
          + "australiasoutheast",
          + "brazilsouth",
          + "canadacentral",
          + "canadaeast",
          + "centralindia",
          + "centralus",
          + "eastasia",
          + "eastus",
          + "eastus2",
          + "francecentral",
          + "francesouth",
          + "germanynorth",
          + "germanywestcentral",
          + "global",
          + "japaneast",
          + "japanwest",
          + "koreacentral",
          + "koreasouth",
          + "northcentralus",
          + "northeurope",
          + "norwayeast",
          + "norwaywest",
          + "southafricanorth",
          + "southafricawest",
          + "southcentralus",
          + "southeastasia",
          + "southindia",
          + "switzerlandnorth",
          + "switzerlandwest",
          + "uaecentral",
          + "uaenorth",
          + "uksouth",
          + "ukwest",
          + "westcentralus",
          + "westeurope",
          + "westindia",
          + "westus",
          + "westus2",
        ]
      + name               = (known after apply)
      + storage_account_id = (known after apply)

      + retention_policy {
          + days    = 7
          + enabled = true
        }
    }

  # module.az_activity_log.azurerm_resource_group.lacework[0] will be created
  + resource "azurerm_resource_group" "lacework" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = (known after apply)
    }

  # module.az_activity_log.azurerm_role_assignment.lacework will be created
  + resource "azurerm_role_assignment" "lacework" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.az_activity_log.azurerm_role_definition.lacework will be created
  + resource "azurerm_role_definition" "lacework" {
      + assignable_scopes           = (known after apply)
      + description                 = "Used by Lacework to monitor Activity Logs"
      + id                          = (known after apply)
      + name                        = (known after apply)
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = (known after apply)

      + permissions {
          + actions      = [
              + "Microsoft.Resources/subscriptions/resourceGroups/read",
              + "Microsoft.Storage/storageAccounts/read",
              + "Microsoft.Storage/storageAccounts/blobServices/containers/read",
              + "Microsoft.Storage/storageAccounts/queueServices/queues/read",
              + "Microsoft.EventGrid/eventSubscriptions/read",
              + "Microsoft.Storage/storageAccounts/listkeys/action",
            ]
          + data_actions = [
              + "Microsoft.Storage/storageAccounts/blobServices/containers/blobs/read",
              + "Microsoft.Storage/storageAccounts/queueServices/queues/messages/delete",
              + "Microsoft.Storage/storageAccounts/queueServices/queues/messages/read",
            ]
        }
    }

  # module.az_activity_log.azurerm_storage_account.lacework[0] will be created
  + resource "azurerm_storage_account" "lacework" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "westus2"
      + min_tls_version                  = "TLS1_0"
      + name                             = (known after apply)
      + nfsv3_enabled                    = false
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + shared_access_key_enabled        = true

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.az_activity_log.azurerm_storage_queue.lacework will be created
  + resource "azurerm_storage_queue" "lacework" {
      + id                   = (known after apply)
      + name                 = (known after apply)
      + storage_account_name = (known after apply)
    }

  # module.az_activity_log.lacework_integration_azure_al.default will be created
  + resource "lacework_integration_azure_al" "default" {
      + created_or_updated_by   = (known after apply)
      + created_or_updated_time = (known after apply)
      + enabled                 = true
      + id                      = (known after apply)
      + intg_guid               = (known after apply)
      + name                    = "TF activity log"
      + org_level               = (known after apply)
      + queue_url               = (known after apply)
      + retries                 = 5
      + tenant_id               = "13161a1e-0709-44f7-8fc8-1b08c4242047"
      + type_name               = (known after apply)

      + credentials {
          + client_id     = (known after apply)
          + client_secret = (sensitive value)
        }
    }

  # module.az_activity_log.random_id.uniq will be created
  + resource "random_id" "uniq" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.az_activity_log.time_sleep.wait_time will be created
  + resource "time_sleep" "wait_time" {
      + create_duration = "20s"
      + id              = (known after apply)
    }

  # module.az_config.lacework_integration_azure_cfg.default will be created
  + resource "lacework_integration_azure_cfg" "default" {
      + created_or_updated_by   = (known after apply)
      + created_or_updated_time = (known after apply)
      + enabled                 = true
      + id                      = (known after apply)
      + intg_guid               = (known after apply)
      + name                    = "TF config"
      + org_level               = (known after apply)
      + retries                 = 5
      + tenant_id               = "13161a1e-0709-44f7-8fc8-1b08c4242047"
      + type_name               = (known after apply)

      + credentials {
          + client_id     = (known after apply)
          + client_secret = (sensitive value)
        }
    }

  # module.az_config.time_sleep.wait_time will be created
  + resource "time_sleep" "wait_time" {
      + create_duration = "20s"
      + id              = (known after apply)
    }

  # module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0] will be created
  + resource "azuread_application" "lacework" {
      + app_role                       = (known after apply)
      + application_id                 = (known after apply)
      + available_to_other_tenants     = (known after apply)
      + display_name                   = "lacework_security_audit"
      + fallback_public_client_enabled = (known after apply)
      + homepage                       = (known after apply)
      + id                             = (known after apply)
      + identifier_uris                = []
      + logout_url                     = (known after apply)
      + name                           = (known after apply)
      + oauth2_allow_implicit_flow     = (known after apply)
      + oauth2_permissions             = (known after apply)
      + object_id                      = (known after apply)
      + owners                         = (known after apply)
      + prevent_duplicate_names        = false
      + public_client                  = (known after apply)
      + reply_urls                     = (known after apply)
      + sign_in_audience               = (known after apply)
      + type                           = "webapp/api"

      + api {
          + oauth2_permission_scope {
              + admin_consent_description  = (known after apply)
              + admin_consent_display_name = (known after apply)
              + enabled                    = (known after apply)
              + id                         = (known after apply)
              + type                       = (known after apply)
              + user_consent_description   = (known after apply)
              + user_consent_display_name  = (known after apply)
              + value                      = (known after apply)
            }
        }

      + required_resource_access {
          + resource_app_id = "e406a681-f3d4-42a8-90b6-c2b029497af1"

          + resource_access {
              + id   = "03e0da56-190b-40ad-a80c-ea378c433f7f"
              + type = "Scope"
            }
        }
      + required_resource_access {
          + resource_app_id = "00000002-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "5778995a-e1bf-45b8-affa-663a9f3f4d04"
              + type = "Role"
            }
        }
      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d"
              + type = "Scope"
            }
          + resource_access {
              + id   = "df021288-bdef-4463-88db-98f22de89214"
              + type = "Role"
            }
        }
      + required_resource_access {
          + resource_app_id = "cfa8b339-82a2-471a-a3c9-0fc0be7a4093"

          + resource_access {
              + id   = "f53da476-18e3-4152-8e01-aec403e6edc0"
              + type = "Scope"
            }
        }

      + web {
          + homepage_url  = (known after apply)
          + logout_url    = (known after apply)
          + redirect_uris = (known after apply)

          + implicit_grant {
              + access_token_issuance_enabled = (known after apply)
            }
        }
    }

  # module.az_config.module.az_cfg_ad_application.azuread_application_password.client_secret[0] will be created
  + resource "azuread_application_password" "client_secret" {
      + application_object_id = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + end_date              = "2299-12-31T01:02:03Z"
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0] will be created
  + resource "azuread_service_principal" "lacework" {
      + app_roles      = (known after apply)
      + application_id = (known after apply)
      + display_name   = (known after apply)
      + id             = (known after apply)
      + object_id      = (known after apply)

      + oauth2_permission_scopes {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + enabled                    = (known after apply)
          + id                         = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0] will be created
  + resource "azurerm_role_assignment" "grant_reader_role_to_subscriptions" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.az_activity_log.random_id.uniq: Creating...
module.az_activity_log.random_id.uniq: Creation complete after 0s [id=VKJtJQ]
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Creating...
module.az_activity_log.azurerm_resource_group.lacework[0]: Creating...
module.az_activity_log.azurerm_resource_group.lacework[0]: Creation complete after 2s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25]
module.az_activity_log.azurerm_role_definition.lacework: Creating...
module.az_activity_log.azurerm_storage_account.lacework[0]: Creating...
module.az_activity_log.azurerm_role_definition.lacework: Creation complete after 1s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/1f5f867e-3400-ba6d-5467-ada3ca292326|/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25]
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Still creating... [10s elapsed]
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Creation complete after 11s [id=faebbeff-3490-43a5-9efc-5ded47885685]
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0]: Creating...
module.az_activity_log.azurerm_storage_account.lacework[0]: Still creating... [10s elapsed]
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0]: Still creating... [10s elapsed]
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0]: Provisioning with 'local-exec'...
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0] (local-exec): Executing: ["/bin/sh" "-c" "az ad app permission admin-consent --id 3ddf1a25-337c-44b1-b477-5a266a27d0f5 && echo SUCCESS!! || echo ERROR!!! Unable to grant admin consent, grant it manually by following the URL: https://login.microsoftonline.com/13161a1e-0709-44f7-8fc8-1b08c4242047/adminconsent?client_id=3ddf1a25-337c-44b1-b477-5a266a27d0f5"]
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0] (local-exec): ERROR: Bad Request({"ClassName":"Microsoft.Portal.Framework.Exceptions.ClientException","Message":"Graph call failed with httpCode=BadRequest, errorCode=Request_BadRequest, errorMessage=Application '3ddf1a25-337c-44b1-b477-5a266a27d0f5' is requesting permissions that are either invalid or out of date., reason=Bad Request, correlationId = c55c162d-e3af-41c4-9154-060ce75109d4, response = {\"odata.error\":{\"code\":\"Request_BadRequest\",\"message\":{\"lang\":\"en\",\"value\":\"Application '3ddf1a25-337c-44b1-b477-5a266a27d0f5' is requesting permissions that are either invalid or out of date.\"},\"requestId\":\"ca05b7a2-1f99-46ec-a824-82fc14cbf670\",\"date\":\"2021-10-12T21:07:25\"}}","Data":{},"HResult":-2146233088,"XMsServerRequestId":null,"Source":null,"HttpStatusCode":400,"ClientData":{"errorCode":"Request_BadRequest","localizedErrorDetails":{"errorDetail":"Application '3ddf1a25-337c-44b1-b477-5a266a27d0f5' is requesting permissions that are either invalid or out of date."},"operationResults":null,"timeStampUtc":"2021-10-12T21:07:25.4894939Z","clientRequestId":"c55c162d-e3af-41c4-9154-060ce75109d4","internalTransactionId":"6e3a5101-b5df-4ac1-8983-0bef29b9ec38","tenantId":"13161a1e-0709-44f7-8fc8-1b08c4242047","userObjectId":"2b09d7c3-741e-4975-99c3-f37b9de2564a","exceptionType":"AADGraphException"}})
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0] (local-exec): ERROR!!! Unable to grant admin consent, grant it manually by following the URL: https://login.microsoftonline.com/13161a1e-0709-44f7-8fc8-1b08c4242047/adminconsent?client_id=3ddf1a25-337c-44b1-b477-5a266a27d0f5
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0]: Creation complete after 14s [id=4a35f135-1572-4bd1-bcad-426c81278c5d]
module.az_config.module.az_cfg_ad_application.azuread_application_password.client_secret[0]: Creating...
module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Creating...
module.az_activity_log.azurerm_role_assignment.lacework: Creating...
module.az_activity_log.azurerm_storage_account.lacework[0]: Still creating... [20s elapsed]
module.az_activity_log.azurerm_storage_account.lacework[0]: Creation complete after 26s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25]
module.az_activity_log.azurerm_storage_queue.lacework: Creating...
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Creating...
module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Still creating... [10s elapsed]
module.az_activity_log.azurerm_role_assignment.lacework: Still creating... [10s elapsed]
module.az_config.module.az_cfg_ad_application.azuread_application_password.client_secret[0]: Still creating... [10s elapsed]
module.az_activity_log.azurerm_storage_queue.lacework: Creation complete after 0s [id=https://laceworkstorage54a26d25.queue.core.windows.net/lacework-queue-54a26d25]
module.az_activity_log.azurerm_eventgrid_event_subscription.lacework: Creating...
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Still creating... [10s elapsed]
module.az_config.module.az_cfg_ad_application.azuread_application_password.client_secret[0]: Still creating... [20s elapsed]
module.az_activity_log.azurerm_role_assignment.lacework: Still creating... [20s elapsed]
module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Still creating... [20s elapsed]
module.az_activity_log.azurerm_eventgrid_event_subscription.lacework: Still creating... [10s elapsed]
module.az_config.module.az_cfg_ad_application.azuread_application_password.client_secret[0]: Creation complete after 20s [id=faebbeff-3490-43a5-9efc-5ded47885685/password/a51d2877-0700-0089-1b82-73839d422536]
module.az_activity_log.azurerm_role_assignment.lacework: Creation complete after 22s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Authorization/roleAssignments/55804dd4-0fa6-a911-44d2-9b8b436635fb]
module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Creation complete after 22s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/5b50f246-7460-8c96-97d9-6c0a03eb7401]
module.az_config.time_sleep.wait_time: Creating...
module.az_activity_log.azurerm_eventgrid_event_subscription.lacework: Creation complete after 13s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25/providers/Microsoft.EventGrid/eventSubscriptions/lacework-subscription-54a26d25]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Still creating... [20s elapsed]
module.az_config.time_sleep.wait_time: Still creating... [10s elapsed]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Still creating... [30s elapsed]
module.az_config.time_sleep.wait_time: Still creating... [20s elapsed]
module.az_config.time_sleep.wait_time: Creation complete after 20s [id=2021-10-12T21:08:08Z]
module.az_config.lacework_integration_azure_cfg.default: Creating...
module.az_config.lacework_integration_azure_cfg.default: Creation complete after 3s [id=LWINTMAR_3E432B222F448AC1D26D0F3665FAD67F235A15D36C4AA41]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Still creating... [40s elapsed]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Still creating... [50s elapsed]

module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Still creating... [1m0s elapsed]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Still creating... [1m10s elapsed]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Creation complete after 1m16s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/microsoft.insights/logprofiles/lacework-log-profile-54a26d25]
module.az_activity_log.time_sleep.wait_time: Creating...
module.az_activity_log.time_sleep.wait_time: Still creating... [10s elapsed]
module.az_activity_log.time_sleep.wait_time: Still creating... [20s elapsed]
module.az_activity_log.time_sleep.wait_time: Creation complete after 20s [id=2021-10-12T21:09:11Z]
module.az_activity_log.lacework_integration_azure_al.default: Creating...
module.az_activity_log.lacework_integration_azure_al.default: Creation complete after 4s [id=LWINTMAR_0E302076FEDCA8289DF980FA8FA303A5B7CE58DCE80842C]

Apply complete! Resources: 16 added, 0 changed, 0 destroyed.
➜  BROWNFIELD
➜  BROWNFIELD cp main.tf.new main.tf
➜  BROWNFIELD terraform apply
➜  BROWNFIELD terraform init --upgrade
Upgrading modules...
Downloading /Users/marc/Code/terraform-azure-activity-log for az_activity_log...
- az_activity_log in .terraform/modules/az_activity_log
Downloading /Users/marc/Code/terraform-azure-ad-application for az_activity_log.az_al_ad_application...
- az_activity_log.az_al_ad_application in .terraform/modules/az_activity_log.az_al_ad_application
Downloading /Users/marc/Code/terraform-azure-config for az_config...
- az_config in .terraform/modules/az_config
Downloading /Users/marc/Code/terraform-azure-ad-application for az_config.az_cfg_ad_application...
- az_config.az_cfg_ad_application in .terraform/modules/az_config.az_cfg_ad_application

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/time...
- Finding hashicorp/azurerm versions matching "~> 2.28, >= 2.80.0"...
- Finding lacework/lacework versions matching "~> 0.3"...
- Finding hashicorp/azuread versions matching ">= 2.6.0"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Installing hashicorp/azuread v2.6.0...
- Installed hashicorp/azuread v2.6.0 (signed by HashiCorp)
- Using previously-installed hashicorp/random v3.1.0
- Using previously-installed hashicorp/time v0.7.2
- Using previously-installed hashicorp/azurerm v2.80.0
- Using previously-installed lacework/lacework v0.11.2

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
➜  BROWNFIELD terraform apply
module.az_activity_log.random_id.uniq: Refreshing state... [id=VKJtJQ]
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Refreshing state... [id=faebbeff-3490-43a5-9efc-5ded47885685]
module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0]: Refreshing state... [id=4a35f135-1572-4bd1-bcad-426c81278c5d]
module.az_config.module.az_cfg_ad_application.azuread_application_password.client_secret[0]: Refreshing state... [id=faebbeff-3490-43a5-9efc-5ded47885685/password/a51d2877-0700-0089-1b82-73839d422536]
module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/5b50f246-7460-8c96-97d9-6c0a03eb7401]
module.az_activity_log.azurerm_resource_group.lacework[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25]
module.az_config.time_sleep.wait_time: Refreshing state... [id=2021-10-12T21:08:08Z]
module.az_config.lacework_integration_azure_cfg.default: Refreshing state... [id=LWINTMAR_3E432B222F448AC1D26D0F3665FAD67F235A15D36C4AA41]
module.az_activity_log.azurerm_role_definition.lacework: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/1f5f867e-3400-ba6d-5467-ada3ca292326|/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25]
module.az_activity_log.azurerm_storage_account.lacework[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25]
module.az_activity_log.azurerm_role_assignment.lacework: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Authorization/roleAssignments/55804dd4-0fa6-a911-44d2-9b8b436635fb]
module.az_activity_log.azurerm_storage_queue.lacework: Refreshing state... [id=https://laceworkstorage54a26d25.queue.core.windows.net/lacework-queue-54a26d25]
module.az_activity_log.azurerm_monitor_log_profile.lacework[0]: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/microsoft.insights/logprofiles/lacework-log-profile-54a26d25]
module.az_activity_log.azurerm_eventgrid_event_subscription.lacework: Refreshing state... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25/providers/Microsoft.EventGrid/eventSubscriptions/lacework-subscription-54a26d25]
module.az_activity_log.time_sleep.wait_time: Refreshing state... [id=2021-10-12T21:09:11Z]
module.az_activity_log.lacework_integration_azure_al.default: Refreshing state... [id=LWINTMAR_0E302076FEDCA8289DF980FA8FA303A5B7CE58DCE80842C]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0] has been changed
  ~ resource "azuread_application" "lacework" {
      + app_role_ids                   = {}
      + device_only_auth_enabled       = false
      + disabled_by_microsoft          = "<nil>"
      ~ group_membership_claims        = [
          - "",
        ]
        id                             = "faebbeff-3490-43a5-9efc-5ded47885685"
      + oauth2_permission_scope_ids    = {
          + "user_impersonation" = "4729cb46-9b73-45e8-8e12-c55349875474"
        }
      + oauth2_post_response_required  = false
      + publisher_domain               = "csalab.ca"
        # (8 unchanged attributes hidden)

      ~ api {
          + known_client_applications      = []
          + mapped_claims_enabled          = false
          + requested_access_token_version = 1

            # (1 unchanged block hidden)
        }

      + optional_claims {
        }

      + public_client {
          + redirect_uris = []
        }


      + single_page_application {
          + redirect_uris = []
        }

      ~ web {
            # (1 unchanged attribute hidden)

          ~ implicit_grant {
              + id_token_issuance_enabled     = true
                # (1 unchanged attribute hidden)
            }
        }
        # (4 unchanged blocks hidden)
    }
  # module.az_config.module.az_cfg_ad_application.azuread_service_principal.lacework[0] has been changed
  ~ resource "azuread_service_principal" "lacework" {
      + account_enabled              = true
      + alternative_names            = []
      + app_role_ids                 = {}
      + application_tenant_id        = "13161a1e-0709-44f7-8fc8-1b08c4242047"
        id                           = "4a35f135-1572-4bd1-bcad-426c81278c5d"
      + notification_email_addresses = []
      + oauth2_permission_scope_ids  = {
          + "user_impersonation" = "4729cb46-9b73-45e8-8e12-c55349875474"
        }
      + owners                       = []
      + redirect_uris                = []
      + service_principal_names      = []
      + sign_in_audience             = "AzureADMyOrg"
      + tags                         = []
      + type                         = "Application"
        # (6 unchanged attributes hidden)

      + features {
          + custom_single_sign_on_app = false
          + enterprise_application    = false
          + gallery_application       = false
          + visible_to_users          = true
        }
    }
  # module.az_activity_log.azurerm_role_definition.lacework has been changed
  ~ resource "azurerm_role_definition" "lacework" {
        id                          = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/1f5f867e-3400-ba6d-5467-ada3ca292326|/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25"
        name                        = "lacework-role-54a26d25"
        # (5 unchanged attributes hidden)

      ~ permissions {
          + not_actions      = []
          + not_data_actions = []
            # (2 unchanged attributes hidden)
        }
    }
  # module.az_activity_log.azurerm_storage_account.lacework[0] has been changed
  ~ resource "azurerm_storage_account" "lacework" {
        id                             = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25"
        name                           = "laceworkstorage54a26d25"
      + tags                           = {}
        # (30 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # module.az_activity_log.azurerm_resource_group.lacework[0] has been changed
  ~ resource "azurerm_resource_group" "lacework" {
        id       = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25"
        name     = "lacework-group-54a26d25"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }
  # module.az_activity_log.azurerm_eventgrid_event_subscription.lacework has been changed
  ~ resource "azurerm_eventgrid_event_subscription" "lacework" {
        id                                   = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25/providers/Microsoft.EventGrid/eventSubscriptions/lacework-subscription-54a26d25"
      + labels                               = []
        name                                 = "lacework-subscription-54a26d25"
        # (4 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.az_activity_log.azurerm_storage_queue.lacework has been changed
  ~ resource "azurerm_storage_queue" "lacework" {
        id                   = "https://laceworkstorage54a26d25.queue.core.windows.net/lacework-queue-54a26d25"
      + metadata             = {}
        name                 = "lacework-queue-54a26d25"
        # (1 unchanged attribute hidden)
    }
  # module.az_activity_log.lacework_integration_azure_al.default has been changed
  ~ resource "lacework_integration_azure_al" "default" {
        id                      = "LWINTMAR_0E302076FEDCA8289DF980FA8FA303A5B7CE58DCE80842C"
        name                    = "TF activity log"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ client_secret = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }
  # module.az_config.lacework_integration_azure_cfg.default has been changed
  ~ resource "lacework_integration_azure_cfg" "default" {
        id                      = "LWINTMAR_3E432B222F448AC1D26D0F3665FAD67F235A15D36C4AA41"
        name                    = "TF config"
        # (8 unchanged attributes hidden)

      ~ credentials {
          ~ client_secret = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.az_activity_log.azurerm_resource_group.lacework[0] will be updated in-place
  ~ resource "azurerm_resource_group" "lacework" {
        id       = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25"
        name     = "lacework-group-54a26d25"
      ~ tags     = {
          + "purpose" = "lacework-activity-logs"
        }
        # (1 unchanged attribute hidden)
    }

  # module.az_activity_log.azurerm_storage_account.lacework[0] will be updated in-place
  ~ resource "azurerm_storage_account" "lacework" {
        id                             = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25"
        name                           = "laceworkstorage54a26d25"
      ~ tags                           = {
          + "purpose" = "lacework-activity-logs"
        }
        # (30 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.az_config.azurerm_role_assignment.grant_reader_role_to_subscriptions[0] will be created
  + resource "azurerm_role_assignment" "grant_reader_role_to_subscriptions" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4a35f135-1572-4bd1-bcad-426c81278c5d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.az_activity_log.module.az_al_ad_application.azuread_directory_role.dir-reader will be created
  + resource "azuread_directory_role" "dir-reader" {
      + description  = (known after apply)
      + display_name = (known after apply)
      + id           = (known after apply)
      + object_id    = (known after apply)
      + template_id  = "88d8e3e3-8f55-4a1e-953a-9b9898b8876b"
    }

  # module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0] will be updated in-place
  ~ resource "azuread_application" "lacework" {
        id                             = "faebbeff-3490-43a5-9efc-5ded47885685"
      + logo_image                     = "iVBORw0KGgoAAAANSUhEUgAAAKwAAAC4CAYAAAB+dgdVAAAMrUlEQVR4nO2db2xb1RmH3+MVJRUQElCjpCJAkAO4iSI1FUgLsrSySmVUYn9YJ9AmTdB10oo0lWlD+zSkThsfNkY/IFVD6zQmOuimdLQiIUWtIyhztKI4a2kwKFFd6iBbSdWkBkSyQe907vV1HNd27vH9d869v+dLq7RxrnMfnft7zznvMYvc/yQRURs1Nbdqg19/XmvvGCAAJIFdWTzPUslnaS53mogWuLBt1N5539Xv7RqlpmbcJyAlbPTIr9hU6oUIv7ir3/w+ZAVSo219aB+1tPVE+OhKLa24W0BumppJ64k9GtGamttwq4ASbOgciOBOAVXQbmq9E8ICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICpYCwQCkgLFAKCAuUAsICNSgsEptIPrsOtwtIzfISsVTyL2wiuY+WlxYhLJAWlho/ypInn+Ki8nO1+HVCWCAdbCZ9lo2N7KbCwrQpqgmEBfIwm8myZOJpls0crxTVBMIC/+EF1djwHjaTfrWWqCYQFvgHL6jGRvRjNIvXUFdWgrDAFyoqfyuimkBY4ClsavItNjb8uKioJhAWeMNsJht548h3q1X+IkBY4C4WKn8RICxwB175JxNmQWVbVBMIC5yFF1TjiefZRPLXxdd1TFaCsMAxbFT+IkBYYBu98k8mnrZbUFkBwoLGcajyFwHCAnHm80t8LtWpyl8ECAus41LlLwKEBWtjFlTJxM+K/9cXWQnCgrVg4wnXK38RICyoipeVvwgQFqyGV/58t3/x495l++1AWGDAC6rRocf8qPxFgLBhZ3XlTzLLShA2xHi0lOo0EDaEVGufVgUIGyJkrfxFgLBhwOFN1H4CYYOMIpW/CBA2iDTQPq0KEDZIKFr5iwBhA4Ld9mlVgLCKU+/gtAARp6bmFq2rexDCqkqAKv8axPmXtd6Bxyga26ZFYz00m8lDWNUQODhNQQxJu7oHqXdgpxaNbaGm5lXvAsKqgsvt0z4Tp5a227Utg09o0dhWammteTUQVnaCW/kbubRv4FGtd2AnbehosvJNEFZigrCUWsG1uVQQCCsjPrRPu8iauVQECCsTwar8jVzat3mn1jvwcL1cKgKElQEJ2qcdwsil0U07eAFlNZeKAGH9RKL2aRsYj/xo7MHiI184l4oAYX1CtvZpQXRJqb2zTxsY3GU3l4oAYT1G8crflVwqAoT1Csnbp+vgei4VAcK6jY8Hp9lgJZdGN23XejdvkeXCIKxbqFf5r+RSXjz1bt7qVS4VAcI6jXqVv5FLe2LbtYHBH/iRS0WAsA6iUPv0Si7t2/xturW7Q4JrsgSEdQBFKn9pc6kIENYO8i+lKpFLRYCwjSB/+7RSuVQECCuC3AenlXJpo1v3VADCWkHeTdSrc6mHS6R+AWHXQNL26Xgpl67RUhI0IGwNJGyfXsmlAi0lQQPCViJX5R+KXCoChDWRp306dLlUBAgrz8Fplludw0x4hZWj8m+o1TnMhFJYnyt/263OYSZcwvrXPu1oq3OYCYew/lX+yKUOE2xh/dlEjVzqIsEU1vuD0zxtdQ4zwRLW28rft1bnMBMYYT3cRO17q3OYUV9Yb9qnpWp1DitsLp9WV1j326eRS2Vj+fNP1rG53L81lS7a3cofuVRy1hWLE/lxt30auVQFspmkEpHApYPTlG11DjOGsIVFknFUcaHyD0Src1hhc7lzRWEXstTS2iXN78HZpdTAtTqHluWlAhd2gS0tLWhE/gvrbPt0YFudQ8lsJk+lSDCfS1E01u/b78G59mnk0oDCrix+TESnDGGvLJ735W06s5SKXBoG5nNpWim69KLGUxw4OC2OXBoi5nLnyBSWZ0avFg9sVv5odQ4pLJtJ0qq9BG5PbTVe+aPVOewUCy4qF5bN5c5qLa3OF16NtU+j1RmU4JteeMFFZcIu0GzmpKMzBY21T4f2CB5Qh+z5cfMfVyKBsT3PPuKVP3IpqAubSY+a/74SCRwovATap9HqDKxRll+pcgM3PwBNayAWWDw4Da3OQBg2kz5h5leqEFY8x1qr/NHqDBqGTaePl3/v6hF2Ov2q9rWHnlrzxdfeRI1WZ2Cf+fwyFRY+Kn+d1fth+SN9Pr9EGzqqP6vrt08jlwJHYVOpf5THAarShLjAplIHrhlla1f+yKXANSrjAFXrmq2MBTWWUpFLgbvw2YGKOEBV27y5mLOZLP9rxcFpaHUGnsHOTf6zMg5QjXMJFiKHD95W/Dt/5Peh1Rl4Co+gU6lXqv3IasKi1Rn4CpuaHKv186t2zV7d/fO3kUuBX7CJ5J+rxQFOpOo1FRbyVb8OgMuwmfR0tWKrnrCnWDKxHzcG+EIqebDW6Eq1Rlh9d3dBjQNhQICYzeTNzoJaVI8EXNpk4gBcAF5SfLLXHF2pjrCn9GkFjLLAKyyMrlRvhCWMssBDrIyutIawxijLd8wA4CYWR9e1hDWkHRt+BjcLuElkbGSfldGVLAhrzBhUtCkA4BRsanLCPCTDEWG5+ZE3jvwCdwg4jt5ZrT/BLY2uZFFYvvL1ERtPHMMdA07CxhMv8yM0RV7SmrA8y04kX8Q0F3CM+fyy7pTA6EoCwuqHybLRoV/ijgEnEI0CJtaF5aNsNpNkqfGaW78AsAJ3yOo0lh1hydgYc/I5RAPQMHrH9cnnGhldqQFhEQ2ALXR3BAutcr7CbrtP9HsussJihJrX30GdXd24fcAqfKaJTU0ebnR0pYZGWANjBQzLtsAqfFYgmfi9HVnJhrCkLyiMDvEj33HPQH2Wlyjy2qEf2ZWVbAqrnzvPxkawowvURXekTtuLCI1k2HIusvlcAXkW1ILvFWDj9qOAib0R1gB5FlSH51YeGx2SlRwSlvQ8e/hPj2B+FpTguZU74aCs5KCw+vxs5OihPSjCACfy94N77My31sJuhi3nIn326Xq6PJ+je/rjuGvhhY0eOcAuTCecHl3JYWFJL8IuX/ofFRaXKBq718kXBmqgLw6kxHdhWcVpYak0c8DoFurqvtuNiwZyos8IjI00tAvLKm4IS7q02czHdFNbP7V3bnTlyoFU8COG2PDhPW7KSi4KS7q0M+k0pA0B8/nlyNFDT9CXX5xw+826KSxB2hDAZeXTV8tLw168WbeFJUgbYDyWlTwSliBtAPFBVvJQWIK0AcInWcljYQnSBgAfZSUfhCVIqzA+y0o+CUslabEtUR0kkJV8FJZ0aS9Mn8cyrvzwRQF9ntVnWclnYam0jDufy1H3XXFaV/VDbYCP6MutfAXLg0UBK/gtLJkbZtiF6Xe1e/p3QFp50DeyuLw3QBQZhCVzayI7c3pI677rEbr+BljrM/oWQRd3XTWKLMKSLu2XX0yzD85O0vU33o0ZBJ/gnQKv/HGPW/tZ7SKTsAZcWj6D8N+l6+iOnn4ZLik08JmAv77wLSosZmWUlaQU1uAiy2Uv0WzmQ4pu2oZc6z68uIq8fvgnxZmAi7Jep6zCknkkkp5rN3Y9QC1tN0hwTYFEz6u8FVuSmYB6yCwslXLt1ORpdDC4QGFRbxaUNa9WQ3ZhTYwOBh4Ruu7cho/Dt4++GDD00g9lzqvVUEVYKkWEqdQQ3bzhXrp5wy0SXJN68A/COHHsADv15m+KEUDavFoNlYSlUkT48L3/YHWsAfT9AAcfZ7OZd1QaVctRTVgTY3XszGmMthbhq1bFWYDXVRtVy1FVWMJoaxE+qh556afsg/deU3VULUdlYU1WRluskK3As+o7b74cGR3aS599OqTyqFpOEISl0mjLV8j4TEL7xniY9yMY2wH/tlel6SqrBEVYEz6T8C925vRb+tJuZ1d/qGIC/4SW0aHfsvHEH1TPqrUImrAm+tKuHhPWXdcZ+K4G/vh/9+1jkaOHdrPLl2aCNqqWwyL3PynP1bhDnFrabr/6je/8jm7t7gjamzPOsxp+pni0ZWBFNQmDsCZxrat7UBt8YG8QxNXPshob2Vf87IDAi2oSJmFN1BZ3NpNnycT+4kdfhkZUkzAKa6KUuHxEpVTyYFhFNQmzsCZxau/s0wYGd2m9m7fIcUkr6Bk1mdgftkd/LSDsCnFqam7Rtgz+WOsdeJhaWv27Ej49NZU6xiaSL4almLIKhL0W/fMZtGjsQYpu2u7lqMtHU5p5/zibSY8WvwRRK4Cw9TFG3eimHRSNbdOisR6nf4CeTWfSJ9jM+8MYTdcGwlrHkLere5C67vyq/ueGjibhV+GP+2zGGEl5AQVJhYCwjWMI3N7ZR1zepvU3au0dscpXY3P5NC1//gllM0k2lztX9tlVkFQUIvo/tEt7gsI7E2UAAAAASUVORK5CYII="
      + logo_url                       = (known after apply)
      + marketing_url                  = "https://www.lacework.com/"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "4729cb46-9b73-45e8-8e12-c55349875474"
        } -> (known after apply)
      ~ owners                         = [
          + "2b09d7c3-741e-4975-99c3-f37b9de2564a",
        ]
        # (13 unchanged attributes hidden)

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access lacework_security_audit on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access lacework_security_audit" -> null
              - enabled                    = true -> null
              - id                         = "4729cb46-9b73-45e8-8e12-c55349875474" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access lacework_security_audit on your behalf." -> null
              - user_consent_display_name  = "Access lacework_security_audit" -> null
              - value                      = "user_impersonation" -> null
            }
        }



      - required_resource_access {
          - resource_app_id = "e406a681-f3d4-42a8-90b6-c2b029497af1" -> null

          - resource_access {
              - id   = "03e0da56-190b-40ad-a80c-ea378c433f7f" -> null
              - type = "Scope" -> null
            }
        }
      - required_resource_access {
          - resource_app_id = "00000002-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "5778995a-e1bf-45b8-affa-663a9f3f4d04" -> null
              - type = "Role" -> null
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d" -> null
              - type = "Scope" -> null
            }
          - resource_access {
              - id   = "df021288-bdef-4463-88db-98f22de89214" -> null
              - type = "Role" -> null
            }
        }
      - required_resource_access {
          - resource_app_id = "cfa8b339-82a2-471a-a3c9-0fc0be7a4093" -> null

          - resource_access {
              - id   = "f53da476-18e3-4152-8e01-aec403e6edc0" -> null
              - type = "Scope" -> null
            }
        }


      ~ web {
          + homepage_url  = "https://www.lacework.com"
            # (1 unchanged attribute hidden)

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # module.az_config.module.az_cfg_ad_application.azuread_directory_role.dir-reader will be created
  + resource "azuread_directory_role" "dir-reader" {
      + description  = (known after apply)
      + display_name = (known after apply)
      + id           = (known after apply)
      + object_id    = (known after apply)
      + template_id  = "88d8e3e3-8f55-4a1e-953a-9b9898b8876b"
    }

  # module.az_config.module.az_cfg_ad_application.azuread_directory_role_member.lacework-dir-reader[0] will be created
  + resource "azuread_directory_role_member" "lacework-dir-reader" {
      + id               = (known after apply)
      + member_object_id = "4a35f135-1572-4bd1-bcad-426c81278c5d"
      + role_object_id   = (known after apply)
    }

  # module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0] will be destroyed
  - resource "azurerm_role_assignment" "grant_reader_role_to_subscriptions" {
      - id                   = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/5b50f246-7460-8c96-97d9-6c0a03eb7401" -> null
      - name                 = "5b50f246-7460-8c96-97d9-6c0a03eb7401" -> null
      - principal_id         = "4a35f135-1572-4bd1-bcad-426c81278c5d" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7" -> null
    }

Plan: 4 to add, 3 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.az_config.module.az_cfg_ad_application.azuread_directory_role.dir-reader: Creating...
module.az_activity_log.module.az_al_ad_application.azuread_directory_role.dir-reader: Creating...
module.az_config.module.az_cfg_ad_application.azuread_directory_role.dir-reader: Creation complete after 1s [id=e95def2f-62ef-4a21-9ee9-1e1cc644c08e]
module.az_activity_log.module.az_al_ad_application.azuread_directory_role.dir-reader: Creation complete after 1s [id=e95def2f-62ef-4a21-9ee9-1e1cc644c08e]
module.az_config.module.az_cfg_ad_application.azuread_directory_role_member.lacework-dir-reader[0]: Creating...
module.az_config.module.az_cfg_ad_application.azuread_directory_role_member.lacework-dir-reader[0]: Creation complete after 3s [id=e95def2f-62ef-4a21-9ee9-1e1cc644c08e/member/4a35f135-1572-4bd1-bcad-426c81278c5d]
module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Destroying... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/5b50f246-7460-8c96-97d9-6c0a03eb7401]
module.az_activity_log.azurerm_resource_group.lacework[0]: Modifying... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25]
module.az_config.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Creating...
module.az_activity_log.azurerm_resource_group.lacework[0]: Modifications complete after 0s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25]
module.az_activity_log.azurerm_storage_account.lacework[0]: Modifying... [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25]
module.az_config.module.az_cfg_ad_application.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Destruction complete after 1s
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Modifying... [id=faebbeff-3490-43a5-9efc-5ded47885685]
module.az_config.module.az_cfg_ad_application.azuread_application.lacework[0]: Modifications complete after 2s [id=faebbeff-3490-43a5-9efc-5ded47885685]
module.az_activity_log.azurerm_storage_account.lacework[0]: Modifications complete after 9s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/resourceGroups/lacework-group-54a26d25/providers/Microsoft.Storage/storageAccounts/laceworkstorage54a26d25]
module.az_config.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Still creating... [10s elapsed]
module.az_config.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Still creating... [20s elapsed]
module.az_config.azurerm_role_assignment.grant_reader_role_to_subscriptions[0]: Creation complete after 23s [id=/subscriptions/4c59c315-0e39-4ae5-82d8-8c0bbf639fd7/providers/Microsoft.Authorization/roleAssignments/34139318-8ba1-be3f-c455-9a00c5fc1299]

Apply complete! Resources: 4 added, 3 changed, 1 destroyed.